NSCameraUsageDescription = "Kamera inatumika katika miito ya video";
NSMicrophoneUsageDescription = "Kamera inatumika katika miito ya sauti na video";
NSPhotoLibraryUsageDescription = "Idhini ya kufikia Maktaba ya Picha inahitajika ili kushiriki picha na video kutoka kwenye kifaa chako";
NSContactsUsageDescription = "Idhini ya kufikia anwani inahitajika ili kulinganisha anwani za kitabu chako cha anwani na mawasiliano kwenye seva yako";
NSLocationWhenInUseUsageDescription = "Inahitajika kushirikisha eneo lako na wengine";
NSSpeechRecognitionUsageDescription = "Ufikiaji wa Kitambulisho cha Usemi unahitajika ili kunakili ujumbe wa sauti hadi maandishi kwa kutumia utambuzi wa kifaa";
